# Part 4B TMDB Data Transfer
-Loveida Lucero

**Imports**

In [1]:
# Import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import glob

## Importing the OS and JSON Modules
import os,json

# importing plotly
import plotly.express as px
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
with open('/Users/Lovei/.secret/mysql.json')as f:
    login = json.load(f)
    
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection  = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

**Load Data**

In [4]:
# Use glob to get all filepaths that match the pattern (*=wildcard)
tmdb_files = sorted(glob.glob("Data/final_tmdb_data*.csv.gz"))
tmdb_files

['Data\\final_tmdb_data_2000.csv.gz',
 'Data\\final_tmdb_data_2001.csv.gz',
 'Data\\final_tmdb_data_2002.csv.gz',
 'Data\\final_tmdb_data_2003.csv.gz',
 'Data\\final_tmdb_data_2004.csv.gz',
 'Data\\final_tmdb_data_2005.csv.gz',
 'Data\\final_tmdb_data_2006.csv.gz',
 'Data\\final_tmdb_data_2007.csv.gz',
 'Data\\final_tmdb_data_2008.csv.gz',
 'Data\\final_tmdb_data_2009.csv.gz',
 'Data\\final_tmdb_data_2010.csv.gz',
 'Data\\final_tmdb_data_2011.csv.gz',
 'Data\\final_tmdb_data_2012.csv.gz',
 'Data\\final_tmdb_data_2013.csv.gz',
 'Data\\final_tmdb_data_2014.csv.gz',
 'Data\\final_tmdb_data_2015.csv.gz',
 'Data\\final_tmdb_data_2016.csv.gz',
 'Data\\final_tmdb_data_2017.csv.gz',
 'Data\\final_tmdb_data_2018.csv.gz',
 'Data\\final_tmdb_data_2019.csv.gz',
 'Data\\final_tmdb_data_2020.csv.gz',
 'Data\\final_tmdb_data_2021.csv.gz',
 'Data\\final_tmdb_data_2022.csv.gz']

In [5]:
# Use read_csv in a list comprehension and combine with concat to load all files
df = pd.concat([pd.read_csv(f) for f in tmdb_files] )
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 63028 entries, 0 to 3928
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                63028 non-null  object
 1   adult                  63005 non-null  float64
 2   backdrop_path          42257 non-null  object
 3   belongs_to_collection  4315 non-null   object
 4   budget                 63005 non-null  float64
 5   genres                 63005 non-null  object
 6   homepage               15398 non-null  object
 7   id                     63005 non-null  float64
 8   original_language      63005 non-null  object
 9   original_title         63005 non-null  object
 10  overview               61774 non-null  object
 11  popularity             63005 non-null  float64
 12  poster_path            58732 non-null  object
 13  production_companies   63005 non-null  object
 14  production_countries   63005 non-null  object
 15  release_date           61908 non-null  object
 16  revenue                63005 non-null  float64
 17  runtime                63005 non-null  float64
 18  spoken_languages       63005 non-null  object
 19  status                 63005 non-null  object
 20  tagline                24491 non-null  object
 21  title                  63005 non-null  object
 22  video                  63005 non-null  float64
 23  vote_average           63005 non-null  float64
 24  vote_count             63005 non-null  float64
 25  certification          15254 non-null  object
dtypes: float64(9), object(17)
memory usage: 13.0+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.10,2369.0,PG

# Prep Data for SQL Transfer

In [6]:
# find total movies with valid revenue
filter_revenue = df['revenue'] >0
filter_revenue.sum()

8145

In [7]:
# Filter out any movies with no revenue data as this is the target
df = df[filter_revenue]
df.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8145 entries, 4 to 3911
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                8145 non-null   object
 1   adult                  8145 non-null   float64
 2   backdrop_path          7800 non-null   object
 3   belongs_to_collection  1570 non-null   object
 4   budget                 8145 non-null   float64
 5   genres                 8145 non-null   object
 6   homepage               3523 non-null   object
 7   id                     8145 non-null   float64
 8   original_language      8145 non-null   object
 9   original_title         8145 non-null   object
 10  overview               8112 non-null   object
 11  popularity             8145 non-null   float64
 12  poster_path            8099 non-null   object
 13  production_companies   8145 non-null   object
 14  production_countries   8145 non-null   object
 15  release_date           8130 non-null   object
 16  revenue                8145 non-null   float64
 17  runtime                8145 non-null   float64
 18  spoken_languages       8145 non-null   object
 19  status                 8145 non-null   object
 20  tagline                5803 non-null   object
 21  title                  8145 non-null   object
 22  video                  8145 non-null   float64
 23  vote_average           8145 non-null   float64
 24  vote_count             8145 non-null   float64
 25  certification          5335 non-null   object
dtypes: float64(9), object(17)
memory usage: 1.7+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.100,2369.0,PG
10,tt0120202,0.0,/tuerGhZ1lA8wpBjUCEUpeTWDT5B.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",http://www.newline.com/properties/stateandmain...,21991.0,en,State and Main,...,9206279.0,106.0,"[{'english_name': 'Italian', 'iso_639_1': 'it'...",Released,Big movie. Small town. Huge trouble.,State and Main,0.0,6.327,185.0,NaN

In [8]:
print(f"There are {len(df)} movies with valid revenue.")

There are 8145 movies with valid revenue.

In [9]:
#drop rows with nulls in runtime and genres
df = df.dropna(subset=['runtime','genres'])

In [10]:
# filter out documentary
filter_doc = df['genres'].str.contains('Documentary')
df = df[~filter_doc]

# Genres

## Normalize Genre Data

In [11]:
df = df.reset_index(drop=True)

In [12]:
def get_genres(row):
    row_list = eval(row)
    return [each['name'] for each in row_list]

In [13]:
df['genre_list'] = df['genres'].apply(get_genres)

In [14]:
df_with_genre = df.explode('genre_list')

In [15]:
df_with_genre = df_with_genre[['imdb_id', 'genre_list']]

In [16]:
df_with_genre['genre_list'] = df_with_genre['genre_list'].replace(
    {'Science Fiction': 'Sci-Fi'}
)

In [17]:
q='''SELECT * FROM genres'''
df_sql_g = pd.read_sql(q, conn )
df_sql_g

    id        name
0    0      Action
1    1       Adult
2    2   Adventure
3    3   Animation
4    4   Biography
5    5      Comedy
6    6       Crime
7    7       Drama
8    8      Family
9    9     Fantasy
10  10   Game-Show
11  11     History
12  12      Horror
13  13       Music
14  14     Musical
15  15     Mystery
16  16        News
17  17  Reality-TV
18  18     Romance
19  19      Sci-Fi
20  20       Sport
21  21   Talk-Show
22  22    Thriller
23  23         War
24  24     Western

In [18]:
genre_dict = {v:k for k, v in zip(df_sql_g['id'], df_sql_g['name'])}

In [19]:
df_sql_g.head(3)

   id       name
0   0     Action
1   1      Adult
2   2  Adventure

In [20]:
df_with_genre['genre_code'] = df_with_genre['genre_list'].map(genre_dict)

In [21]:
df_with_genre[df_with_genre['genre_code'].isnull()]['genre_list'].value_counts()

TV Movie    3
Name: genre_list, dtype: int64

In [22]:
df_with_genre.isnull().sum()

imdb_id        0
genre_list    29
genre_code    32
dtype: int64

In [23]:
df_with_genre = df_with_genre.dropna()
df_with_genre['genre_code'] = df_with_genre['genre_code'].astype(int)
df_with_genre

        imdb_id genre_list  genre_code
0     tt0118694      Drama           7
0     tt0118694    Romance          18
1     tt0120202     Comedy           5
1     tt0120202      Drama           7
2     tt0120263      Drama           7
...         ...        ...         ...
8133  tt9764362     Comedy           5
8133  tt9764362   Thriller          22
8133  tt9764362     Horror          12
8134  tt9783730      Drama           7
8134  tt9783730      Music          13

[20290 rows x 3 columns]

In [24]:
unique_genres = sorted(df_with_genre['genre_list'].unique())
unique_genres

['Action',
 'Adventure',
 'Animation',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'History',
 'Horror',
 'Music',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']

In [25]:
# Map out a dictioary for genre ids
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adventure': 1,
 'Animation': 2,
 'Comedy': 3,
 'Crime': 4,
 'Drama': 5,
 'Family': 6,
 'Fantasy': 7,
 'History': 8,
 'Horror': 9,
 'Music': 10,
 'Mystery': 11,
 'Romance': 12,
 'Sci-Fi': 13,
 'Thriller': 14,
 'War': 15,
 'Western': 16}

In [26]:
genre_map['Adventure']= 2
genre_map['Animation']= 3
genre_map['Comedy']= 5
genre_map['Crime']= 6
genre_map['Drama']= 7
genre_map['Family']= 8
genre_map['Fantasy']= 9
genre_map['History']= 11
genre_map['Horror']= 12
genre_map['Music']= 13
genre_map['Mystery']= 15
genre_map['Romance']= 18
genre_map['Sci-Fi']= 19
genre_map['Thriller']= 22
genre_map['War']= 23
genre_map['Western']= 24
genre_map

{'Action': 0,
 'Adventure': 2,
 'Animation': 3,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Mystery': 15,
 'Romance': 18,
 'Sci-Fi': 19,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

**All genres already exist in sql. No need to transfer**

# Title_Genres

In [27]:
title_genres = df_with_genre[['imdb_id','genre_list']].copy()
title_genres

        imdb_id genre_list
0     tt0118694      Drama
0     tt0118694    Romance
1     tt0120202     Comedy
1     tt0120202      Drama
2     tt0120263      Drama
...         ...        ...
8133  tt9764362     Comedy
8133  tt9764362   Thriller
8133  tt9764362     Horror
8134  tt9783730      Drama
8134  tt9783730      Music

[20290 rows x 2 columns]

In [28]:
title_genres['genres_id'] = title_genres['genre_list'].map(genre_map)
title_genres = title_genres.drop(columns = 'genre_list')
title_genres

        imdb_id  genres_id
0     tt0118694          7
0     tt0118694         18
1     tt0120202          5
1     tt0120202          7
2     tt0120263          7
...         ...        ...
8133  tt9764362          5
8133  tt9764362         22
8133  tt9764362         12
8134  tt9783730          7
8134  tt9783730         13

[20290 rows x 2 columns]

In [29]:
# rename column
rename = {'imdb_id':'title_basics_tconst'}
title_genres = title_genres.rename(rename, axis=1)
title_genres

     title_basics_tconst  genres_id
0              tt0118694          7
0              tt0118694         18
1              tt0120202          5
1              tt0120202          7
2              tt0120263          7
...                  ...        ...
8133           tt9764362          5
8133           tt9764362         22
8133           tt9764362         12
8134           tt9783730          7
8134           tt9783730         13

[20290 rows x 2 columns]

In [31]:
# Load df to sql
try:
    title_genres.to_sql('title_genres', engine, index=False, if_exists='append')
except Exception as e:
    print('cannot append', e)

# Ratings

In [32]:
ratings = df[['imdb_id','vote_average','vote_count']].copy()
ratings.head(3)

     imdb_id  vote_average  vote_count
0  tt0118694         8.100      2369.0
1  tt0120202         6.327       185.0
2  tt0120263         7.200       249.0

In [33]:
rename_rating = {'imdb_id':'tconst',
                'vote_average':'average_rating',
                'vote_count':'number_of_votes'}
ratings = ratings.rename(rename_rating, axis=1)
ratings.head()

      tconst  average_rating  number_of_votes
0  tt0118694           8.100           2369.0
1  tt0120202           6.327            185.0
2  tt0120263           7.200            249.0
3  tt0120467           5.500             44.0
4  tt0120630           6.763           4537.0

In [34]:
# Load df to sql
try:
    ratings.to_sql('ratings', engine, index=False, if_exists='append')
except Exception as e:
    print('cannot append', e)

cannot append (pymysql.err.IntegrityError) (1062, "Duplicate entry 'tt0118694' for key 'ratings.PRIMARY'")
[SQL: INSERT INTO ratings (tconst, average_rating, number_of_votes) VALUES (%(tconst)s, %(average_rating)s, %(number_of_votes)s)]
[parameters: ({'tconst': 'tt0118694', 'average_rating': 8.1, 'number_of_votes': 2369.0}, {'tconst': 'tt0120202', 'average_rating': 6.327, 'number_of_votes': 185.0}, {'tconst': 'tt0120263', 'average_rating': 7.2, 'number_of_votes': 249.0}, {'tconst': 'tt0120467', 'average_rating': 5.5, 'number_of_votes': 44.0}, {'tconst': 'tt0120630', 'average_rating': 6.763, 'number_of_votes': 4537.0}, {'tconst': 'tt0120753', 'average_rating': 5.868, 'number_of_votes': 295.0}, {'tconst': 'tt0120755', 'average_rating': 6.118, 'number_of_votes': 6195.0}, {'tconst': 'tt0120903', 'average_rating': 6.997, 'number_of_votes': 10595.0}  ... displaying 10 of 8135 total bound parameter sets ...  {'tconst': 'tt9764362', 'average_rating': 7.19, 'number_of_votes': 3846.0}, {'tconst': 'tt9783730', 'average_rating': 6.769, 'number_of_votes': 13.0})]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

# Title_Basics

In [35]:
title_basics = df[['imdb_id','title','release_date','runtime']].copy()
title_basics.head()

     imdb_id                        title release_date  runtime
0  tt0118694         In the Mood for Love   2000-09-29     99.0
1  tt0120202               State and Main   2000-08-26    106.0
2  tt0120263  Songs from the Second Floor   2000-10-06     99.0
3  tt0120467                       Vulgar   2002-04-26     87.0
4  tt0120630                  Chicken Run   2000-06-23     84.0

In [36]:
#rename columns for consistency
rename_basics = {'imdb_id':'tconst',
                'title':'primary_title'}
title_basics = title_basics.rename(rename_basics, axis=1)
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8135 entries, 0 to 8134
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         8135 non-null   object
 1   primary_title  8135 non-null   object
 2   release_date   8120 non-null   object
 3   runtime        8135 non-null   float64
dtypes: float64(1), object(3)
memory usage: 254.3+ KB

      tconst                primary_title release_date  runtime
0  tt0118694         In the Mood for Love   2000-09-29     99.0
1  tt0120202               State and Main   2000-08-26    106.0
2  tt0120263  Songs from the Second Floor   2000-10-06     99.0
3  tt0120467                       Vulgar   2002-04-26     87.0
4  tt0120630                  Chicken Run   2000-06-23     84.0

In [37]:
#split release date into separate columns and drop day/month
title_basics = title_basics.copy()
title_basics['release_date'] = pd.to_datetime(title_basics['release_date'],errors='coerce')
title_basics['start_year'] = title_basics['release_date'].dt.year
title_basics['month'] = title_basics['release_date'].dt.month
title_basics['day'] = title_basics['release_date'].dt.day
title_basics.head()

#collaborated with Christina Brockway

,tconst,primary_title,release_date,runtime,start_year,month,day
0,tt0118694,In the Mood for Love,2000-09-29,99.0,2000.0,9.0,29.0
1,tt0120202,State and Main,2000-08-26,106.0,2000.0,8.0,26.0
2,tt0120263,Songs from the Second Floor,2000-10-06,99.0,2000.0,10.0,6.0
3,tt0120467,Vulgar,2002-04-26,87.0,2002.0,4.0,26.0
4,tt0120630,Chicken Run,2000-06-23,84.0,2000.0,6.0,23.0

In [38]:
cols_to_drop = ['release_date','month','day']
title_basics = title_basics.drop(columns=cols_to_drop)
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8135 entries, 0 to 8134
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         8135 non-null   object
 1   primary_title  8135 non-null   object
 2   runtime        8135 non-null   float64
 3   start_year     8120 non-null   float64
dtypes: float64(2), object(2)
memory usage: 254.3+ KB

      tconst                primary_title  runtime  start_year
0  tt0118694         In the Mood for Love     99.0      2000.0
1  tt0120202               State and Main    106.0      2000.0
2  tt0120263  Songs from the Second Floor     99.0      2000.0
3  tt0120467                       Vulgar     87.0      2002.0
4  tt0120630                  Chicken Run     84.0      2000.0

In [39]:
#check for null values
title_basics['start_year'].isna().sum()

15

In [40]:
# fill null values with placeholder 0 to convert to int
title_basics['start_year'] = title_basics['start_year'].fillna(0)
title_basics['start_year'].value_counts(dropna=False)

2017.0    533
2016.0    499
2019.0    462
2018.0    460
2014.0    457
2015.0    439
2010.0    409
2009.0    403
2011.0    397
2007.0    394
2012.0    378
2008.0    359
2006.0    355
2022.0    320
2005.0    318
2021.0    317
2004.0    298
2020.0    297
2002.0    269
2003.0    254
2001.0    239
2000.0    212
2013.0     26
2023.0     25
0.0        15
Name: start_year, dtype: int64

In [41]:
#convert to int
title_basics['start_year'] = title_basics['start_year'].astype(int)
title_basics.dtypes

tconst            object
primary_title     object
runtime          float64
start_year         int32
dtype: object

In [42]:
# check for null values
title_basics['runtime'].isna().sum()

0

In [43]:
#convert to int
title_basics['runtime'] = title_basics['runtime'].astype(int)
title_basics.dtypes

tconst           object
primary_title    object
runtime           int32
start_year        int32
dtype: object

In [44]:
# Load df to sql
try:
    title_basics.to_sql('title_basics', engine, index=False, if_exists='append')
except Exception as e:
    print('cannot append', e)

cannot append (pymysql.err.IntegrityError) (1062, "Duplicate entry 'tt0118694' for key 'title_basics.PRIMARY'")
[SQL: INSERT INTO title_basics (tconst, primary_title, runtime, start_year) VALUES (%(tconst)s, %(primary_title)s, %(runtime)s, %(start_year)s)]
[parameters: ({'tconst': 'tt0118694', 'primary_title': 'In the Mood for Love', 'runtime': 99, 'start_year': 2000}, {'tconst': 'tt0120202', 'primary_title': 'State and Main', 'runtime': 106, 'start_year': 2000}, {'tconst': 'tt0120263', 'primary_title': 'Songs from the Second Floor', 'runtime': 99, 'start_year': 2000}, {'tconst': 'tt0120467', 'primary_title': 'Vulgar', 'runtime': 87, 'start_year': 2002}, {'tconst': 'tt0120630', 'primary_title': 'Chicken Run', 'runtime': 84, 'start_year': 2000}, {'tconst': 'tt0120753', 'primary_title': 'The Million Dollar Hotel', 'runtime': 122, 'start_year': 2000}, {'tconst': 'tt0120755', 'primary_title': 'Mission: Impossible II', 'runtime': 123, 'start_year': 2000}, {'tconst': 'tt0120903', 'primary_title': 'X-Men', 'runtime': 104, 'start_year': 2000}  ... displaying 10 of 8135 total bound parameter sets ...  {'tconst': 'tt9764362', 'primary_title': 'The Menu', 'runtime': 107, 'start_year': 2022}, {'tconst': 'tt9783730', 'primary_title': 'On the Come Up', 'runtime': 115, 'start_year': 2022})]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

# TMDB_Data

In [45]:
tmdb_data=df[['imdb_id','budget','revenue','certification']].copy()
tmdb_data.info()
tmdb_data.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8135 entries, 0 to 8134
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        8135 non-null   object
 1   budget         8135 non-null   float64
 2   revenue        8135 non-null   float64
 3   certification  5330 non-null   object
dtypes: float64(2), object(2)
memory usage: 254.3+ KB

     imdb_id    budget     revenue certification
0  tt0118694  150000.0  14204632.0            PG
1  tt0120202       0.0   9206279.0           NaN

In [46]:
#check value counts for consistency
tmdb_data['certification'].value_counts()

R         2427
PG-13     1745
PG         674
NR         344
G          122
NC-17       17
PG-13        1
Name: certification, dtype: int64

In [47]:
# combine the 2 pg-13 values
tmdb_data['certification'] = tmdb_data['certification'].replace({'PG-13 ':'PG-13'})
tmdb_data['certification'].value_counts()

R        2427
PG-13    1746
PG        674
NR        344
G         122
NC-17      17
Name: certification, dtype: int64

In [48]:
# redefine dtypes
from sqlalchemy.types import *
# Make dictionary with column and datatype
tmdb_types = {"imdb_id":CHAR(12),
            "revenue":FLOAT(),
            "budget":FLOAT(),
            "certification":VARCHAR(7)}

In [49]:
# Load df to sql replacing existing values
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_types, index=False, if_exists='replace')

8135

In [50]:
# Set primary key for tmdb_data
q = '''ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);'''
engine.execute(q)

# Confirm Data Transfer in SQL

In [51]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [52]:
#display db info
q = '''DESCRIBE tmdb_data;'''
describe_td = pd.read_sql(q, conn)
describe_td

           Field        Type Null  Key Default Extra
0        imdb_id    char(12)   NO  PRI    None
1         budget       float  YES         None
2        revenue       float  YES         None
3  certification  varchar(7)  YES         None

In [53]:
# Confirm data has been added
q = """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0118589  22000000.0   5271670.0         PG-13
2  tt0118694    150000.0  14204600.0            PG
3  tt0118926         0.0   5227350.0             R
4  tt0119004         0.0      6297.0          None

In [54]:
#display db info
q = '''DESCRIBE title_basics;'''
describe_tb = pd.read_sql(q, conn)
describe_tb

           Field          Type Null  Key Default Extra
0         tconst   varchar(12)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [55]:
# Confirm data has been added
q = """
SELECT * FROM title_basics
LIMIT 5;
"""
pd.read_sql(q,engine)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [56]:
#display db info
q = '''DESCRIBE title_genres;'''
describe_tg = pd.read_sql(q, conn)
describe_tg

                 Field         Type Null Key Default Extra
0  title_basics_tconst  varchar(12)   NO        None
1            genres_id          int   NO        None

In [57]:
# Confirm data has been added
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

  title_basics_tconst  genres_id
0           tt0035423          5
1           tt0035423          9
2           tt0035423         18
3           tt0062336          7
4           tt0069049          7

In [58]:
#display db info
q = '''DESCRIBE ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

             Field         Type Null  Key Default Extra
0           tconst  varchar(12)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [59]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [60]:
#display db info
q = '''DESCRIBE genres;'''
describe_g = pd.read_sql(q, conn)
describe_g

  Field         Type Null  Key Default Extra
0    id          int   NO  PRI    None
1  name  varchar(30)  YES         None

In [61]:
# Confirm data has been added
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

   id       name
0   0     Action
1   1      Adult
2   2  Adventure
3   3  Animation
4   4  Biography